Repository: Aprilpop/Invictus-GiveItUpStack
Catalog: giu-stack/Assets/SmartLocalizationWorkspace/Data/LanguageData/Language.*-*.resx
Languages: chs, hu

# SatiricComment.DiedOnNormalStage17
source: Oops, we didn't test this one.
chs: 糟糕，我们没有对此进行测试。
hu: Hopsz, ezt nem teszteltük.

# SatiricComment.DiedOnNormalStage18
source: Do you even try?
chs: 你甚至尝试吗？
hu: Próbálkozol egyáltalán?

# SatiricComment.DiedOnNormalStage19
source: Do you even lift bro?
chs: 你还举兄弟吗？

# SatiricComment.DiedOnNormalStage2
source: Ouch!
chs: 哎哟!
hu: Jajj!

# SatiricComment.DiedOnNormalStage20
source: Fun fact: You are the only one who died here.
chs: 有趣的事实：您是唯一在这里死亡的人。
hu: Vicces tény: Te vagy az egyetlen, aki itt meghalt.

# SatiricComment.DiedOnNormalStage21
source: Just relax!
chs: 放轻松！
hu: Nyugi!

# SatiricComment.DiedOnNormalStage22
source: Maybe next time...
chs: 下次吧...
hu: Talán legközelebb...

# SatiricComment.DiedOnNormalStage23
source: Maybe you should turn on the music.
chs: 也许您应该打开音乐。
hu: Talán be kellene kapcsolnod a zenét.

# SatiricComment.DiedOnNormalStage24
source: May the Blob be with you!
chs: 愿Blob与您同在！
hu: A Blob legyen veled!

# SatiricComment.DiedOnNormalStage25
source: Oh, that was just a placeholder.
chs: 哦，那只是一个占位符。
hu: Oh, az csak véletlenül maradt ott.

# SatiricComment.DiedOnNormalStage26
source: You may be strong, but I'm stronger.
chs: 你可能很坚强，但我却更坚强。
hu: Lehet hogy te erős vagy, de én erősebb.

# SatiricComment.DiedOnNormalStage27
source: %RANDOM% blob died during the test process and counting.
chs: ％RANDOM％Blob在测试过程和计数过程中死亡。
hu: Eddig %RANDOM% blob halt meg a tesztelés alatt.

# SatiricComment.DiedOnNormalStage28
source: Should I call mommy?
chs: 我应该打电话给妈妈吗？
hu: Hívjam anyut?

# SatiricComment.DiedOnNormalStage29
source: WASTED
chs: 浪费
hu: ELPUSZTÍTVA

# SatiricComment.DiedOnNormalStage3
source: Git gud!
chs: 吉特神！
hu: Legyél jobb!

# SatiricComment.DiedOnNormalStage30
source: Houston, we have a problem!
chs: 休斯顿，我们有一个问题！
hu: Houston, baj van!

# SatiricComment.DiedOnNormalStage31
source: Get a better gadget, after you break this one!
chs: 弄碎此小工具后，请准备一个更好的小工具！
hu: Szerezz jobb kütyüt ha ezt már összetöröd!

# SatiricComment.DiedOnNormalStage32
source: Have faith!
chs: 有信心！
hu: Higgy!

# SatiricComment.DiedOnNormalStage33
source: You are not alone!
chs: 你不是一个人！
hu: Nem vagy egyedül!

# SatiricComment.DiedOnNormalStage34
source: Feeling down?
chs: 心情失落？
hu: Le vagy törve?

# SatiricComment.DiedOnNormalStage35
source: Not tired yet?
chs: 还不累吗
hu: Nem fáradtál még el?

# SatiricComment.DiedOnNormalStage36
source: Are you drunk?
chs: 你醉了吗？
hu: Részeg vagy?

# SatiricComment.DiedOnNormalStage37
source: Need a therapist?
chs: 需要治疗师吗？
hu: Segítség kell?

# SatiricComment.DiedOnNormalStage39
source: Pro Tip #%TIPRANDOM%: Try jumping at the right time.
chs: 专业提示#％TIPRANDOM％：尝试在正确的时间跳跃。
hu: Pro Tip #%TIPRANDOM%: Próbálj jó időben ugrani.

# SatiricComment.DiedOnNormalStage4
source: My mom could do it!
chs: 我妈妈可以做到！
hu: Anyum meg tudta csinálni!

# SatiricComment.DiedOnNormalStage40
source: Pro Tip #%TIPRANDOM%: The spike kills you.
chs: 专家提示#％TIPRANDOM％：尖峰杀死您。
hu: Pro Tip #%TIPRANDOM%: A tüske megöl.

# SatiricComment.DiedOnNormalStage41
source: Pro Tip #%TIPRANDOM%: Don't bang your head against the wall.
chs: 专家提示#％TIPRANDOM％：不要将头撞在墙上。
hu: Pro Tip #%TIPRANDOM%: Ne verd a falba a fejed.

# SatiricComment.DiedOnNormalStage43
source: You died %RANDOM% times. Isn't it enough?
chs: 您死亡％RANDOM％次。
hu: Már %RANDOM%-szor meghaltál. Nem elég?

# SatiricComment.DiedOnNormalStage44
source: You are lucky that the restart is free.
chs: 您很幸运，重新启动是免费的。
hu: Szerencséd van, az újrakezdés ingyen van.

# SatiricComment.DiedOnNormalStage46
source: Try Give It Up! 1 or 2 first.
chs: 尝试放弃！
hu: Próbáld ki a Give It Up! 1 vagy 2-t először.

# SatiricComment.DiedOnNormalStage47
source: Hello darkness, my old friend...
chs: 你好黑暗，我的老朋友...
hu: Üdv sötétség, régi barátom...

# SatiricComment.DiedOnNormalStage48
source: Aint' nobody get time for this.
chs: 没有人有时间这样做。
hu: Senkinek sincs erre ideje.

# SatiricComment.DiedOnNormalStage49
source: Cry on my shoulder.
chs: 哭在我的肩膀上。
hu: Sírj a vállamon.

# SatiricComment.DiedOnNormalStage5
source: Don't worry, be happy!
chs: 别担心，要开心！
hu: Reggelizz, ne háborúzz.

# SatiricComment.DiedOnNormalStage50
source: Are you salty?
chs: 你咸吗？
hu: Ideges vagy?

# SatiricComment.DiedOnNormalStage51
source: Calm down! That way you will be calm.
chs: 冷静！
hu: Nyugodj meg, attól nyugodt leszel.

# SatiricComment.DiedOnNormalStage6
source: Are you ill?
chs: 你是不是生病了？
hu: Beteg vagy?

# SatiricComment.DiedOnNormalStage7
source: It's not that hard!
chs: 没那么难！
hu: Nem is olyan nehéz!

# SatiricComment.DiedOnNormalStage8
source: I can do it with my eyes closed!
chs: 我可以闭着眼睛做！
hu: Én meg tudom csinálni csukott szemmel!

# SatiricComment.DiedOnNormalStage9
source: Give it up!
chs: 放弃！
hu: Add fel!

# SatiricComment.NormalStageFinished10
source: MOM! Get the camera!
chs: 妈妈！
hu: ANYA! Hozd a kamerát!

# SatiricComment.NormalStageFinished11
source: Lucky!
chs: 幸运！
hu: Szerencsés!

# SatiricComment.NormalStageFinished12
source: Difficulty level set to nightmare.
chs: 难度等级设置为噩梦。
hu: Nehézségi szint: rémálom.

# SatiricComment.NormalStageFinished13
source: Just barely!
chs: 只是勉强！
hu: Épphogy!

# SatiricComment.NormalStageFinished14
source: Got the hang of it!
chs: 掌握了它！
hu: Kezdesz ráérezni!

# SatiricComment.NormalStageFinished15
source: At last!
chs: 最后！
hu: Na végre!

# SatiricComment.NormalStageFinished16
source: How did you manage it?
chs: 您是如何管理的？
hu: Hogy csináltad?

# SatiricComment.NormalStageFinished17
source: You deserve a cookie.
chs: 您应该得到一个cookie。
hu: Jár a keksz!

# SatiricComment.NormalStageFinished18
source: Is it really the goal?
chs: 这真的是目标吗？
hu: Vajon tényleg ez lenne a cél?

# SatiricComment.NormalStageFinished19
source: You totally cheated!
chs: 你完全被骗了！
hu: Tuti csaltál!

# SatiricComment.NormalStageFinished2
source: Good job!
chs: 做得好！
hu: Szép munka!

# SatiricComment.NormalStageFinished21
source: Now at least you can cry from happiness.
chs: 现在至少您可以从幸福中哭泣。
hu: Most legalább a boldogságtól sírsz.

# SatiricComment.NormalStageFinished3
source: Nice!
chs: 真好！
hu: Szép!

# SatiricComment.NormalStageFinished4
source: Great!
chs: 大！
hu: Nagyszerű!

# SatiricComment.NormalStageFinished5
source: You did it!
chs: 你做到了！
hu: Megcsináltad!

# SatiricComment.NormalStageFinished6
source: Not bad…
chs: 不错…
hu: nem rossz...

# SatiricComment.NormalStageFinished7
source: Unbelievable!
chs: 难以置信的！
hu: Hihetetlen!

# SatiricComment.NormalStageFinished8
source: I'm not even mad, that's amazing!
chs: 我什至没有生气，这太神奇了！
hu: Nem is vagyok mérges, ez lenyűgöző!

# Theme1
source: Labor
chs: 劳工

# Theme2
source: Forest
chs: 森林
hu: Erdő

# Theme3
source: Computer
chs: 电脑
hu: Számítógép

# Theme4
source: Office
chs: 办公室
hu: Iroda

# Theme5
source: Kids Room
chs: 儿童房
hu: Gyerekszoba

# Tutorial.JumpIndicatorMiss
source: MISS!
chs: 小姐！
hu: MELLÉ!

# Tutorial.JumpIndicatorPerfect
source: PERFECT!
chs: 完善！
hu: TÖKÉLETES!

# Tutorial.Objective1
source: Do {0} perfect jumps!
chs: 做{0}个完美的跳跃！
hu: Ugorj {0} tökéleteset!

# Tutorial.Objective2
source: Get through the spikes and reach the next checkpoint!
chs: 克服峰值，到达下一个检查点！
hu: Juss át a tüskéken és érd el a következő ellenörzőpontot!

# Tutorial.Objective3
source: Get through the high platforms and reach the next checkpoint!
chs: 通过高平台，到达下一个检查站！
hu: Juss át a magas akadályokon és érd el a következő ellenörzőpontot!

# Tutorial.Objective4
source: This is the final section. Reach the end to complete the tutorial!
chs: 这是最后一节。
hu: Ez az utolsó szakasz. Juss a végére hogy teljesítsd az oktatópályát!

source: VOICE MAKER
chs: 声音制作者
hu: HANGRÖGZÍTŐ

source: Voicemaker Info
chs: 发声者信息
hu: Hangrögzító információ

# VoiceMaker.Message1
source: You can record your voice for Blob's actions with the Voice Maker.
chs: 您可以使用Voice Maker录制Blob动作的声音。
hu: A Voice Maker használatával felveheted a saját hangod a paca cselekvéseihez.

# VoiceMaker.Message2
source: To use this feature, you have to allow recording from the microphone.
chs: 要使用此功能，您必须允许通过麦克风录音。
hu: A funkció használatához engedélyezned kell a mikrofonnal történő felvételt.

# VoiceMaker.Message3
source: The recorded samples will stay on your device, they won't be uploaded anywhere.
chs: 录制的样本将保留在您的设备上，不会被上传到任何地方。
hu: A felvett hangminták csak a készülékeden lesznek tárolva, feltöltésre nem kerülnek.

# VoiceMaker.Message4
source: Please don't cover the microphone while recording.
chs: 录音时请勿遮盖麦克风。
hu: Felvétel közben ne takard le a mikrofont.

# VoiceMaker.MicrophonePermission
source: Microphone Permission
chs: 麦克风许可
hu: Mikrofon engedély

# VoiceMaker.MicrophonePermissionMessage
source: The application is not permitted to use the microphone! Do you want to allow it?
chs: 该应用程序不允许使用麦克风！ Do you want to allow it?
hu: Nincs engedélyezve a mikrofon használata! Engedélyezed most?

# VoiceMaker.VoiceMakerNameBallBorn
source: Appear
chs: 出现
hu: Megjelenik

# VoiceMaker.VoiceMakerNameBallJump
source: Jump
chs: 跳
hu: Ugrás

# VoiceMaker.VoiceMakerNameBallKilled
source: Splash
chs: 溅
hu: Placcs

source: WORLD MAP
chs: 世界地图
hu: VILÁGTÉRKÉP

# WorldMap.Tutorial
source: Tutorial
chs: 讲解
hu: Oktató pálya

# SatiricComment.ContinueFromCheckpoint42
source: Use your better hand!
hu: Használd az ügyesebb kezed.

# SatiricComment.DiedOnNormalStage14
source: RLY?
hu: KOMOLY?

# SatiricComment.DiedOnNormalStage38
source: Pro Tip #%TIPRANDOM%: Nah.. you don't deserve any tip.
hu: Pro Tip #%TIPRANDOM%: Eh...nem érdemelsz tippet

# SatiricComment.NormalStageFinished1
source: GG!
hu: Jó játék volt!

# SatiricComment.NormalStageFinished20
source: EZ PZ!
hu: Túl könnyű.
