Repository: Aprilpop/Invictus-GiveItUpStack
Catalog: giu-stack/Assets/SmartLocalizationWorkspace/Data/LanguageData/Language.*-*.resx
Languages: chs, hu

# Accessories.Face.Clown
source: Clown mask
chs: 小丑面具
hu: Bohóc álarc

# Accessories.Face.DiverGlasses
source: Snorkel
chs: 呼吸管
hu: Búvárszemüveg

# Accessories.Face.Fawkes
source: Fawkes mask
chs: 福克斯面具
hu: Fawkes álarc

# Accessories.Face.GasMask
source: Gas mask
chs: 防毒面具
hu: Gázmaszk

# Accessories.Face.GlassFunny1
source: Funny glasses #1
chs: 有趣的眼镜#1
hu: Vicces szemüveg #1

# Accessories.Face.GlassFunny2
source: Funny glasses #2
chs: 有趣的眼镜#2
hu: Vicces szemüveg #2

# Accessories.Face.Jason
source: Hockey mask
chs: 曲棍球面具
hu: Jégkorongos maszk

# Accessories.Face.MAD
source: Evil facemask
chs: 邪恶面罩
hu: Gonosz maszk

# Accessories.Face.NoFace
source: No-Face mask
chs: 无面膜
hu: Arctalan maszk

# Accessories.Face.Pacifier
source: Pacifier
chs: 安抚奶嘴
hu: Cumi

# Accessories.Face.Scream
source: Ghost mask
chs: 鬼面膜
hu: Szellem álarc

# Accessories.Face.SkiGlasses
source: Ski goggles
chs: 滑雪镜
hu: Síszemüveg

# Accessories.Face.Sunglasses1
source: Sunglasses #1
chs: 太阳镜#1
hu: Napszemüveg #1

# Accessories.Face.Sunglasses2
source: Sunglasses #2
chs: 太阳镜#2
hu: Napszemüveg #2

# Accessories.Face.Sunglasses3
source: Sunglasses #3
chs: 太阳镜#3
hu: Napszemüveg #3

# Accessories.Face.Sunglasses4
source: Sunglasses #4
chs: 太阳镜#4
hu: Napszemüveg #4

# Accessories.Face.Sunglasses5
source: Sunglasses #5
chs: 太阳镜#5
hu: Napszemüveg #5

# Accessories.Face.Sunglasses6
source: Sunglasses #6
chs: 太阳镜#6
hu: Napszemüveg #6

# Accessories.Face.TheatreMask1
source: Theatre mask #1
chs: 剧院面具#1
hu: Színházi álarc #1

# Accessories.Face.TheatreMask2
source: Theatre mask #2
chs: 剧院面具#2
hu: Színházi álarc #2

# Accessories.Face.Tiki
source: Tiki mask
chs: 蒂基面具
hu: Tiki maszk

# Accessories.Face.WeldingMask
source: Welding goggles
chs: 电焊眼镜
hu: Hegesztő szemüveg

# Accessories.Hand.Baseball
source: Baseball bat
chs: 棒球棒
hu: Baseball ütő

# Accessories.Hand.Blades
source: Metal claws
chs: 金属爪
hu: Fém karmok

# Accessories.Hand.Boxing
source: Boxing gloves
chs: 拳击手套
hu: Boksz kesztyűk

# Accessories.Hand.Chef
source: Frying pan
chs: 平底锅
hu: Serpenyő

# Accessories.Hand.Chem
source: Rubber gloves
chs: 橡胶手套
hu: Gumikesztyűk

# Accessories.Hand.Cowboy
source: Revolvers
chs: 左轮手枪
hu: Revolverek

# Accessories.Hand.Crab
source: Crab claws
chs: 蟹爪
hu: Rák ollók

# Accessories.Hand.Finger
source: Four fingered hand
chs: 四指手
hu: Négyujjú kéz

# Accessories.Hand.FingerFur
source: Mittens
chs: 连指手套
hu: Egyujjas kesztyű

# Accessories.Hand.Glove
source: Fan gloves #1
chs: 风扇手套#1
hu: Szurkoló kesztyű #1

# Accessories.Hand.GloveMetal
source: Fan gloves #2
chs: 风扇手套#2
hu: Szurkoló kesztyű #2

# Accessories.Hand.HandshakeHands
source: Handshake hands
chs: 握手
hu: Kézfogó kesztyű

# Accessories.Hand.Laser
source: Laser swords
chs: 激光剑
hu: Fénykardok

# Accessories.Hand.MugAndPrecel
source: Mug and precel
chs: 杯子和precel
hu: Korsó és perec

# Accessories.Hand.Plastic
source: Plastic hands
chs: 塑胶手
hu: Műanyag kezek

# Accessories.Hand.Stick
source: Chopsticks
chs: 筷子
hu: Evőpálcikák

# Accessories.Hand.TennisRacket
source: Tennis racket
chs: 网球拍
hu: Teniszütő

# Accessories.Hand.Terminator
source: Robotic hand
chs: 机械手
hu: Robot kéz

# Accessories.Hand.Tool
source: Toolbox and hammer
chs: 工具箱和锤子
hu: Szerszámos láda és kalapács

# Accessories.Hand.Warrior
source: Sword and shield
chs: 剑与盾
hu: Kard és pajzs

# Accessories.Hand.Weight
source: Dumbbells
chs: 哑铃
hu: Súlyzók

# Accessories.Hand.Y_Bamboo
source: Bamboo
chs: 竹
hu: Bambusz

# Accessories.Hand.Y_Pirate_HookAndMug
source: Pirate Hook and Mug
chs: 海盗钩和杯子
hu: Kalóz kampó

# Accessories.Hand.Zombie
source: Zombie hands
chs: 僵尸手
hu: Zombi kezek

# Accessories.Hat.BaseballHat1
source: Baseball hat #1
chs: 棒球帽#1
hu: Baseball sapka #1

# Accessories.Hat.BaseballHat2
source: Baseball hat #2
chs: 棒球帽#2
hu: Baseball sapka #2

# Accessories.Hat.BaseballHat3
source: Baseball hat #3
chs: 棒球帽#3
hu: Baseball sapka #3

# Accessories.Hat.Bunny
source: Bunny ears
chs: 兔耳朵
hu: Nyuszifülek

# Accessories.Hat.Chef
source: Chef hat
chs: 老板有
hu: Séf sapka

# Accessories.Hat.Chinese
source: Round cap
chs: 圆帽
hu: Kerek kalap

# Accessories.Hat.ClownHat
source: Clown hat
chs: 小丑帽
hu: Bohóc kalap

# Accessories.Hat.CowboyHat
source: Cowboy hat
chs: 牛仔帽
hu: Cowboy kalap

# Accessories.Hat.Crown
source: Crown
chs: 王冠
hu: Korona

# Accessories.Hat.Cylinder
source: Tophat
chs: 高帽
hu: Cilinder

# Accessories.Hat.GangsterHat
source: Fedora
chs: 软呢帽

# Accessories.Hat.HeadPhone
source: D.J. headphones
chs: D.J.
hu: D.J. fejhallgató

# Accessories.Hat.Helmet
source: Simple helmet
chs: 简单头盔
hu: Egyszerű sisak

# Accessories.Hat.HelmetBaseball
source: Baseball helmet
chs: 棒球头盔
hu: Baseball sisak

# Accessories.Hat.HelmetFootball
source: Football helmet
chs: 足球头盔
hu: Rögbi sisak

# Accessories.Hat.HelmetSafety
source: Safety Helmet
chs: 安全帽
hu: Munkavédelmi sisak

# Accessories.Hat.Indian
source: War Bonnet
chs: 战争帽子
hu: Indián fejdísz

# Accessories.Hat.JesterHat
source: Jester hat
chs: 小丑帽
hu: Bohóc sapka

# Accessories.Hat.Kitty
source: Cat ears
chs: 猫耳朵
hu: Cicafülek

# Accessories.Hat.NewYear
source: Party hat
chs: 派对帽
hu: Parti csákó

# Accessories.Hat.Pirate
source: Pirate hat
chs: 海盗帽
hu: Kalóz kalap

# Accessories.Hat.Sombrero
source: Sombrero
chs: 帽子

# Accessories.Hat.University
source: Academic cap
chs: 学术上限
hu: Egyetemi kalap

# Accessories.Hat.Warrior
source: Horned helmet
chs: 角头盔
hu: Viking sisak

# Accessories.Hat.Wizard
source: Witch hat
chs: 女巫帽
hu: Boszorkány süveg

# Accessories.Hat.Y_Bamboo
source: Bamboo
chs: 竹
hu: Bambusz

# Accessories.Hat.Y_Pirate
source: Pirate
chs: 海盗
hu: Kalóz

# Character.Name.Bat
source: Bat
chs: 蝠蝠
hu: Denevér

# Character.Name.Blob
source: Blob
chs: 点点

# Character.Name.Cat
source: Cat
chs: 猫
hu: Cica

# Character.Name.Chloe
source: Chloe
chs: 伊伊

# Character.Name.Daddy
source: Daddy
chs: 盒子
hu: Apu

# Character.Name.Devil
source: Devil
chs: 恶魔
hu: Ördög

# Character.Name.ETT
source: ETT
chs: 蚂蚁

# Character.Name.KITT
source: KITT
chs: 基特

# Character.Name.LittleGirl
source: Little Girl
chs: 春霞
hu: Kislány

# Character.Name.Mia
source: Mia
chs: 小姐姐

# Character.Name.Minion
source: Minion
chs: 胶囊
hu: Minyon

# Character.Name.Octopus
source: Octopus
chs: 章鱼
hu: Oktopusz

# Character.Name.Owl
source: Owl
chs: 猫头鹰
hu: Bagoly

# Character.Name.Panda
source: Panda
chs: 熊猫

# Character.Name.Peach
source: Peach
chs: 桃子
hu: Barack

# Character.Name.Polip
source: Polip
chs: 息肉

# Character.Name.Saturn
source: Saturn
chs: 土星
hu: Szaturnusz

# Character.Name.Star
source: Star
chs: 海星
hu: Csillag

# Character.Name.Thunderbolt
source: Thunderbolt
chs: 霹雳
hu: Villám

# Character.Name.Tito
source: Tito
chs: 铁托

# Character.Name.Y_Hei
source: Hei
chs: 喂喂

# Character.Name.Y_Mouse
source: Mouse
chs: 鼠
hu: Egér

# Character.Name.Y_Pikachu
source: Pikachu
chs: 皮卡丘

# Character.Name.Y_Tubbie
source: Tubbie
chs: 塔比

# CharacterCustomization.Customization
source: CUSTOMIZATION
chs: 定制化
hu: ÖLTÖZŐ

# CharacterCustomization.Reset
source: RESET
chs: 重启
hu: TÖRLÉS

# CharacterCustomization.SaveWithout
source: SAVE WITHOUT THIS ITEM DECORATION!
chs: 节省，不用这个项目装饰！
hu: MENTÉS E DEKORÁCIÓ NÉLKÜL!

# CharacterSelection.Character
source: CHARACTER
chs: 字符
hu: KARAKTER

# CharacterSelection.UnlockBy.FindIn
source: Find in
chs: 查找
hu: Találd meg

# CharacterSelection.UnlockBy.View
source: View
chs: 视图
hu: Nézz videót

# CharacterSelection.Using
source: USING
chs: 使用方法
hu: HASZNÁLATBAN

source: Daily Challenge
chs: 每日的挑战
hu: Napi Kihívás

# DailyChallenge.ChooseDifficultyForTheDay
source: Choose difficulty for the day
chs: 选择当天的难度
hu: Válassz nehézséget a napra!

# DailyChallenge.CompleteEasy
source: Complete the easy difficulty {0} time(s) to unlock this. (Only once a day)
chs: 完成难度{0}的轻松时间即可解锁。 (Only once a day)
hu: Teljesítsd a könnyű fokozatot {0} alkalommal, hogy játszhass a közepes fokozaton. (napi egy alkalommal)

# DailyChallenge.CompleteMedium
source: Complete the medium difficulty {0} time(s) to unlock this. (Only once a day)
chs: 完成中等难度{0}次，即可解锁。 (Only once a day)
hu: Teljesítsd a közepes fokozatot {0} alkalommal, hogy játszhass a nehéz fokozaton. (napi egy alkalommal)

# DailyChallenge.DifficultyAlreadySelected
source: Difficulty already selected.
chs: 难度已选定。
hu: Nehézség már kiválasztva.

# DailyChallenge.DifficultyForTheDay
source: Difficulty for the day: {0}
chs: 当天的难度：{0}
hu: Nehézség a napra: {0}

# DailyChallenge.DifficultyFreshlyUnlocked
source: You just unlocked this difficulty. You can try it tomorrow.
chs: 您刚刚解除了这个困难。
hu: Épp megnyitottad ezt a nehézséget. Gyere holnap és próbáld ki!

# DailyChallenge.DifficultyUnlocked
source: DIFFICULTY UNLOCKED
chs: 解锁难度
hu: NEHÉZSÉGI SZINT MEGNYITVA

# DailyChallenge.Easy
source: Easy
chs: 简单
hu: Könnyű

# DailyChallenge.Hard
source: Hard
chs: 硬
hu: Nehéz

# DailyChallenge.HardDifficultyUnlocked
source: Hard Daily Challenge Unlocked! Go and try it.
chs: 艰苦的每日挑战解锁！ Go and try it.
hu: Nehéz fokozat megnyitva! Próbáld ki.

# DailyChallenge.Medium
source: Medium
chs: 介质
hu: Közepes

# DailyChallenge.MediumDifficultyUnlocked
source: Medium Daily Challenge Unlocked! Go and try it.
chs: 中等每日挑战解锁！ Go and try it.
hu: Közepes fokozat megnyitva! Próbáld ki.

# DailyChallenge.SelectDifficulty
source: Select Difficulty
chs: 选择难度
hu: Válassz nehézségi szintet

# DeadPanel.Description
source: Wish to continue?
chs: 希望继续吗？
hu: Szeretnéd folytatni?

# DeadPanel.WatchVideoToUnlock
source: Watch video to continue
chs: 观看视频以继续
hu: Nézz videót

# DeadPanel.YouDied
source: YOU DIED
chs: 你死了
hu: MEGHALTÁL

# Ingame.TapToContinue
source: TAP TO CONTINUE
chs: 点击继续
hu: KOPPINTS A FOLYTATÁSHOZ

# Ingame.Tries
source: {0} try
chs: {0}尝试
hu: {0} próbálkozás

# Loading.Loading
source: LOADING
chs: 载入中
hu: BETÖLTÉS

# MainMenu.Mode.adventure
source: Adventure Mode
chs: 冒险模式
hu: Kaland mód

# MainMenu.Mode.endless
source: Endless Mode
chs: 无尽模式
hu: Végtelen mód

# MainMenu.Mode.none
source: None
chs: 没有
hu: Üres

# MainMenu.Mode.race
source: Race Mode
chs: 比赛模式
hu: Verseny mód

# MainMenu.Mode.relay
source: Relay Mode
chs: 接力模式
hu: Váltó mód

# MainMenu.Mode.SelectGameMode
source: SELECT GAME MODE
chs: 选择游戏模式
hu: VÁLASSZ JÁTÉK MÓDOT

# MainMenu.New
source: New
chs: 新
hu: Új

# Music.Description.Computer001
source: Solitude, such a lonely word, and Blob dances his long and winding way to the end.
chs: 孤独，如此寂寞的话，布洛跳着漫长而曲折的路直到最后。

# Music.Description.Computer002
source: Sometimes we can only find piece and harmony in dreams, where willows line the shore, and egrets chase the yacht. Don't wake me up.
chs: 有时候，我们只能在梦中找到零碎的和谐，柳树在岸边，白鹭追逐游艇。

# Music.Description.Forest001
source: Deep within our inner self, there's always an "alter ego" who wants to seek a different path.
chs: 在我们内在的内心深处，总有一个“另类的自我”想寻求一条不同的道路。

# Music.Description.Forest002
source: This rhytmic and myterious piece gives you a taste of Africa on your palm.
chs: 富有节奏感和神秘感的单品带给您非洲的味道。

# Music.Description.Laboratory001
source: Tubes, flasks, potions! Love is in the air, love is everywhere!
chs: 管，烧瓶，药水！

# Music.Description.Laboratory002
source: The broken glass is featured as a solo intrument, accompanied by the large ensemble! You have to hear it to believe it!
chs: 破碎的玻璃杯是独奏乐器，并带有大型合奏！

# Music.Description.Office001
source: Buried in the chores of life, when can I be far from the madding crowd?
chs: 埋葬在生活中的琐事中，我什么时候可以远离人群呢？

# Music.Description.Office002
source: Was it a vision, or a waking dream? Fled is that music, do I wake or sleep?
chs: 它是愿景还是醒着的梦想？

# Music.Description.Playroom001
source: The caterpillar on the leaf, repeats to me my brother's belief. The fading memories throws me in deep grief, time is an invited thief.
chs: 叶子上的毛毛虫向我重复了我哥哥的信念。

# Music.Description.Playroom002
source: I am the whirlwind that can break the chains, I am the tornado that can topple the mountains, I am whatever I wanna be in this rhapsody.
chs: 我是可以打断铁链的旋风，我是可以翻倒群山的龙卷风，我是我想成为这种狂想曲的人。

# Music.Name.Computer001
source: Blob's Foxtrot
chs: 点点的狐步舞

# Music.Name.Computer002
source: Afrobeat
chs: 非洲节拍

# Music.Name.Forest001
source: Alter Ego
chs: 改变自我

# Music.Name.Forest002
source: Daydream
chs: 白日梦

# Music.Name.Laboratory001
source: Chemical Romance
chs: 化学浪漫

# Music.Name.Laboratory002
source: Glass Concerto
chs: 玻璃协奏曲

# Music.Name.Office001
source: Life in the fast lane
chs: 快节奏生活

# Music.Name.Office002
source: Waking dream
chs: 梦醒

# Music.Name.Playroom001
source: Back to innocence
chs: 童年

# Music.Name.Playroom002
source: Electric rhapsody
chs: 电动狂想曲

# Options.Button.Language
source: Language
chs: 语言
hu: Nyelv

# Options.Button.MusicAndSound
source: Music & Sound
chs: 音乐#amp;
hu: Zene és hang

# Options.Button.Quality
source: Quality
chs: 质量
hu: Minőség

# Options.Button.TapIndicator
source: Tap indicator
chs: 点击指示器
hu: Koppintás jelző

# Options.Options
source: Options
chs: 选件
hu: Beállítások

# Options.Quality.High
source: High
chs: 高
hu: Magas

# Options.Quality.Low
source: Low
chs: 低
hu: Alacsony

# Options.Quality.Medium
source: Medium
chs: 介质
hu: Közepes

# Options.Toggle.Off
source: Off
chs: 关
hu: Ki

# Options.Toggle.On
source: On
chs: 上
hu: Be

# Popup.AccessoryInformationPopup.YouCantEquip
source: You can't equip {0}.
chs: 您无法装备{0}。
hu: Nem tudod {0}-t felvenni.

# Popup.CharacterInformationPopup.YouCantUseThisCharacter
source: You don't have {0}.
chs: 您没有{0}。
hu: Nincs meg {0} neked.

# Popup.Generic.LevelLocked
source: Level locked
chs: 级别锁定
hu: Pálya zárva

# Popup.Generic.LevelLockedDescription
source: This level is locked. Unlock it by completing previous levels.
chs: 此级别已锁定。
hu: Ezt a pályát előszor fel kell nyitnod korábbi pályák teljesítésével.

# Popup.Generic.MoreComing
source: Stay tuned, new levels are coming soon!
chs: 请继续关注，新的水平即将到来！
hu: Légy résen, új pályák érkeznek hamarosan!

# Popup.Generic.NotEnoughMoney
source: Not enough money
chs: 没有足够的钱
hu: Nincs elég pénz

# Popup.Generic.NotEnoughMoney.CoinDescription
source: You don't have enough money to buy this!
chs: 您没有足够的钱来购买！
hu: Nincs elég érméd ennek megvásárlásához.

# Popup.Generic.NotEnoughMoney.DiamondDescription
source: You don't have enough diamonds to buy this!
chs: 您没有足够的钻石来购买！
hu: Nincs elég gyémántod ennek megvásárlásához.

# Popup.Generic.OutOfLevels
source: Out of levels
chs: 超出级别
hu: Nincs több pálya

# Popup.Generic.SureToQuit
source: Are you Giving it up?
chs: 你放弃了吗？
hu: Biztos fel szeretnéd adni?

# Popup.Generic.SureToQuitDescription
source: Well, you may leave the game, but the game will never leave you.
chs: 好吧，您可能会离开游戏，但游戏永远不会离开您。
hu: Habár elhagyhatod a játékot, de a játék sohasem fog elhagyni!

# Popup.Generic.YouHaveFailed
source: You failed
chs: 你失败了
hu: Sikerült

# Popup.Generic.YouHaveSucceeded
source: You have succeeded
chs: 你成功了
hu: Nem sikerült

# Popup.InformationPopup.Locked
source: {0} LOCKED
chs: {0}已锁定
hu: {0} NEM ELÉRHETŐ

# Popup.InformationPopup.YouCanGetItByAchievement
source: You can get it by unlocking {0} achievement!
chs: 您可以通过解锁{0}成就来获得它！
hu: Fel tudod venni ha teljesíted a(z) {0} kihívást!

# Popup.InformationPopup.YouCanGetItByVideo
source: You can get it by watching a video ad!
chs: 您可以通过观看视频广告来获得它！
hu: Felveheted ha megnézel egy videót!

# Popup.InformationPopup.YouCanGetItFromBox
source: You can get it from a box.
chs: 您可以从包装盒中获取。
hu: Megszerezheted egy dobozból.

# Popup.Tutorial.GoodLuck
source: Good Luck!
chs: 祝好运！
hu: Sok szerencsét!

# Popup.Tutorial.NextSectionComing
source: Next section coming
chs: 下一节来了
hu: Következő rész jön.

# Popup.Tutorial.NowYouAreReady
source: Now you are ready for the real challenge!
chs: 现在您已经准备好应对真正的挑战！
hu: Most már készen állsz az igazi kihívásokra!

# Popup.Tutorial.TryAgain
source: Try Again?
chs: 再试一次？
hu: Újra próbálod?

# Popup.Tutorial.TutorialCompleted
source: Tutorial Completed
chs: 教程完成
hu: Oktatás teljesítve

# Popup.Tutorial.YouDidn'tJumped5Times
source: You didn't jumped perfectly 5 times. Try Again?
chs: 您没有跳5次完美。 Try Again?
hu: Nem ugrottál 5 tökéletest.

# Rarity.Common
source: COMMON
chs: 共同
hu: GYAKORI

# Rarity.Legendary
source: LEGENDARY
chs: 传奇的
hu: LEGENDÁS

# Rarity.Rare
source: RARE
chs: 罕见
hu: RITKA

source: RESULTS
chs: 结果
hu: EREDMÉNY

# Results.BestTime
source: Best time!
chs: 最好的时间！
hu: Rekordidő!

# Results.BestTry
source: Best try:
chs: 最佳尝试：
hu: Rekord:

# Results.NewRecord
source: New record!
chs: 新纪录！
hu: Új rekord!

# SatiricComment.ContinueFromCheckpoint1
source: Well well, here we are again..
chs: 好吧，我们又来了..
hu: Nos, itt vagyunk újra..

# SatiricComment.ContinueFromCheckpoint10
source: Oops I did it again!
chs: 哎呀我再次做到了！
hu: Hoppá, megint jól megcsináltam..

# SatiricComment.ContinueFromCheckpoint12
source: I was here before.
chs: 我以前来过这里
hu: Már voltam itt.

# SatiricComment.ContinueFromCheckpoint13
source: Hmm this seems so familiar.
chs: 嗯，这似乎很熟悉。
hu: Hmm, ez ismerősnek tűnik.

# SatiricComment.ContinueFromCheckpoint14
source: Tick tock tick tock.
chs: 滴答滴答声滴答滴答声。
hu: Tik tak tik tak.

# SatiricComment.ContinueFromCheckpoint15
source: Fun fact: Watching an ad helps the developers.
chs: 有趣的事实：观看广告有助于开发人员。
hu: Vicces tény: Segíted a fejlesztőket ha megnézed a reklámot.

# SatiricComment.ContinueFromCheckpoint16
source: You died exactly the same way as before.
chs: 您的死亡与以前完全一样。
hu: Pont ugyanígy haltál meg ezelőtt.

# SatiricComment.ContinueFromCheckpoint18
source: Why are you still at this checkpoint?
chs: 你为什么还在这个检查站？
hu: Miért vagy még mindig ennél az mentőpontnál?

# SatiricComment.ContinueFromCheckpoint19
source: You must really love this checkpoint, don't you?
chs: 您一定很喜欢这个检查站，不是吗？
hu: Nagyon szereted ezt az mentőpontot, igaz?

# SatiricComment.ContinueFromCheckpoint2
source: Do you have enough money to continue?
chs: 您有足够的钱继续吗？
hu: Van elég pénzed a folytatáshoz?

# SatiricComment.ContinueFromCheckpoint20
source: You always come back.
chs: 你总是回来。
hu: Mindig visszatérsz.

# SatiricComment.ContinueFromCheckpoint21
source: See you in 5 sec.
chs: 5秒钟后见。
hu: Találkozunk 5 másodperc múlva!

# SatiricComment.ContinueFromCheckpoint22
source: Keep calm and never give up!
chs: 保持冷静，永不放弃！
hu: Légy nyugodt és soha ne add fel!

# SatiricComment.ContinueFromCheckpoint23
source: Fun fact: You spent %RANDOM% coins on checkpoints.
chs: 有趣的事实：您在检查点上花费了％RANDOM％个硬币。
hu: Vicces tény: %RANDOM% érmét költöttél már mentőpontokra.

# SatiricComment.ContinueFromCheckpoint24
source: Don't die just to see these tips.
chs: 不要仅仅为了看到这些技巧而死。
hu: Ne halj meg csak azért hogy lásd ezeket a tippeket.

# SatiricComment.ContinueFromCheckpoint25
source: Watch an ad to increase your luck.
chs: 观看广告以增加运气。
hu: Ha reklámot nézel megnő a szerencséd.

# SatiricComment.ContinueFromCheckpoint26
source: Watch an ad to decrease the difficulty. (Not really)
chs: 观看广告以降低难度。
hu: Ha megnézel egy reklámot, csökken a nehézség. (Nem is)

# SatiricComment.ContinueFromCheckpoint27
source: Insert coin to continue.
chs: 插入硬币以继续。
hu: Dobj be egy érmét a folytatáshoz.

# SatiricComment.ContinueFromCheckpoint28
source: Here we go again.
chs: 再来一次。
hu: Fussunk neki újra.

# SatiricComment.ContinueFromCheckpoint29
source: The beginning of a beautiful friendship.
chs: 美好友谊的开始。
hu: Egy szép barátság kezdete.

# SatiricComment.ContinueFromCheckpoint3
source: I dare you to continue!
chs: 我敢你继续！
hu: Nem mered újrapróbálni!

# SatiricComment.ContinueFromCheckpoint30
source: Killing spree!
chs: 杀人狂魔！

# SatiricComment.ContinueFromCheckpoint31
source: Why don't you just end it right now?
chs: 您为什么不立即结束呢？
hu: Miért nem hagyod inkább abba most?

# SatiricComment.ContinueFromCheckpoint32
source: You should upgrade your dexterity.
chs: 您应该提高灵活性。
hu: Fejlesztened kéne az ügyességeden.

# SatiricComment.ContinueFromCheckpoint33
source: Do you like killing blobs in your free time?
chs: 您喜欢在业余时间消灭斑点吗？
hu: Szeretsz szabadidődben blobokat ölni?

# SatiricComment.ContinueFromCheckpoint34
source: Take this one round for free. (Just kidding.)
chs: 免费参加这一回合。
hu: Tessék egy ingyen kör. (csak vicceltem)

# SatiricComment.ContinueFromCheckpoint35
source: There's ink. Ink everywhere!
chs: 是墨水
hu: Tinta. Tinta mindenfelé!

# SatiricComment.ContinueFromCheckpoint36
source: Pro Tip #%TIPRANDOM%: You can't die if you don't play.
chs: 专业提示#％TIPRANDOM％：如果您不玩，就不会死。
hu: Pro Tip #%TIPRANDOM%: Nem halsz meg ha nem játszol.

# SatiricComment.ContinueFromCheckpoint37
source: You were at this checkpoint 10 minutes before too.
chs: 您也是在10分钟前到达此检查站。
hu: Ennél a mentőpontnál voltál 10 perccel korábban is.

# SatiricComment.ContinueFromCheckpoint38
source: Take a break.
chs: 休息一下。
hu: Tarts szünetet.

# SatiricComment.ContinueFromCheckpoint39
source: while(true) { Die(); RestartFromCheckpoint() };
chs: while（true）{Die（）;

# SatiricComment.ContinueFromCheckpoint4
source: Relax and watch and ad.
chs: 放松身心，观看广告。
hu: Pihenj amíg nézel egy reklámot.

# SatiricComment.ContinueFromCheckpoint40
source: First try! Oh nevermind, you died.
chs: 第一次尝试！
hu: Elsőre! Oh mégse, meghaltam.

# SatiricComment.ContinueFromCheckpoint41
source: You leveled up! + 10 STR, + 10 VIT
chs: 您升级了！
hu: Szintet léptél! + 10 ERŐ, + 10 ÉLET

# SatiricComment.ContinueFromCheckpoint5
source: It's dangerous to go alone! Take this Ad.
chs: 一个人去很危险！
hu: Veszélyes egyedül menned! Fogd ezt a reklámot.

# SatiricComment.ContinueFromCheckpoint6
source: You will go bankrupt at this rate.
chs: 您将以这种速度破产。
hu: Csődbe fogsz menni ilyen ütemben.

# SatiricComment.ContinueFromCheckpoint7
source: Hah! Long time no see!
chs: 哈哈！
hu: Hah! Rég láttalak!

# SatiricComment.ContinueFromCheckpoint8
source: Wish to continue?
chs: 希望继续吗？
hu: Újra szeretnéd próbálni?

# SatiricComment.ContinueFromCheckpoint9
source: I bet you want to try again!
chs: 我敢打赌，您想再试一次！
hu: Próbáld újra!

# SatiricComment.DailyStageFinished1
source: Come back tomorrow for more!
chs: 明天再来获得更多！
hu: Gyere vissza holnap is!

# SatiricComment.DailyStageFinished2
source: You think you can beat it tomorrow as well?
chs: 您认为明天也可以击败它吗？
hu: Le tudod gyűrni holnap is?

# SatiricComment.DailyStageFinished3
source: You are on fire today!
chs: 你今天着火了！
hu: Nagyon érzed ma!

# SatiricComment.DailyStageFinished4
source: It's your lucky day!
chs: 这是您的幸运日！
hu: Ez a szerencsenapod!

# SatiricComment.DiedOnDailyStage1
source: Don't even try tomorrow!
chs: 明天不要尝试！
hu: Ne is próbálkozz holnap!

# SatiricComment.DiedOnDailyStage2
source: Having a bad day?
chs: 日子不好过吗？
hu: Rossz napod van?

# SatiricComment.DiedOnDailyStage3
source: Tomorrow you may have more luck!
chs: 也许明天您会更幸运！
hu: Talán holnap több szerencséd lesz!

# SatiricComment.DiedOnDailyStage4
source: At least you can keep the coins.
chs: 至少您可以保留硬币。
hu: Legalább az érméket megtarthatod.

# SatiricComment.DiedOnDailyStage5
source: Maybe next day it will be easier.
chs: 也许第二天会更容易。
hu: Holnap talán könnyebb lesz.

# SatiricComment.DiedOnDailyStage6
source: Got hangover? Maybe tomorrow...
chs: 宿醉了吗？
hu: Másnapos vagy? Talán holnap...

# SatiricComment.DiedOnDailyStage7
source: It's not your lucky day.
chs: 这不是你的幸运日。
hu: Ez nem a szerencsés napod.

# SatiricComment.DiedOnDailyStage8
source: Don't bet today!
chs: 今天不要下注！
hu: Ma ne fogadj!

# SatiricComment.DiedOnDailyStage9
source: Get prepared and come back after that.
chs: 准备好之后再回来。
hu: Készülj fel, aztán gyere vissza.

# SatiricComment.DiedOnNormalStage1
source: Get rekt!
chs: 舒展身体！
hu: Megsemmisítve!

# SatiricComment.DiedOnNormalStage10
source: Pathetic try!
chs: 可悲的尝试！
hu: Szánalmas próbálkozás!

# SatiricComment.DiedOnNormalStage11
source: Feel the rhythm!
chs: 感觉节奏！
hu: Érezd a ritmust!

# SatiricComment.DiedOnNormalStage12
source: Come on!
chs: 来吧！
hu: Gyerünk!

# SatiricComment.DiedOnNormalStage13
source: Nice try…
chs: 不错的尝试…
hu: Szép próba...

# SatiricComment.DiedOnNormalStage15
source: Are you serious?
chs: 你是认真的吗？
hu: Komolyan gondoltad?

# SatiricComment.DiedOnNormalStage16
source: Tries %RANDOM%.
chs: 尝试％RANDOM％。
hu: %RANDOM%. próba.
